def solution(letter):
    # 모스 부호 -> 알파벳 매핑
    morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }
    
    # 주어진 모스 부호 문자열을 공백 기준으로 나누어 리스트로 만듬
    letter_list = letter.split()
    
    # 각 모스 부호를 대응하는 알파벳으로 변환하여 결과 문자열을 만듬
    answer = ''.join(morse[code] for code in letter_list)
    
    return answer
